package International_Trade_Union.CorporateCharterDraft;

/**устарел(недействителен), является черновиком, но его хеш используется в генезис блоке.
 Но с помощью новых законов можно добавить те части которые будут интересны и сделать их действительным законом, если
 данные части не противоречат действующему уставу и действующим законам.
 */
public interface ArticleThreeJudiciaryDraft {

    //Статья 3 Судебная власть.
    String Article_3_Judiciary = "Судебная власть Корпорации Международного Торгового Союза принадлежит" +
            " одному Верховному суду и таким нижестоящим судам, которые Корпорация Международный " +
            "Торговый Союз может время от времени издавать и учреждать." +
            " Судьи как верховных, так и нижестоящих судов занимают свои должности при хорошем поведении и " +
            "в установленные сроки получают за свои услуги вознаграждение.";

    String CHAPTER_2 = "Судебная власть распространяется на все дела по закону и справедливости, " +
            "в том числе инициированные членами для оспаривания незаконного расходования средств," +
            " возникающего в соответствии с настоящем Уставом, законами Корпорации Международного Торгового Союза и договорами," +
            " заключенными или которые будут заключены в соответствии с их авторитет; ко всем делам, касающимся послов, " +
            "других государственных министров и консулов; ко всем делам адмиралтейства и морской юрисдикции; к спорам, " +
            "в которых Международный Торговый Союз будут стороной; к разногласиям между двумя или более государствами; " +
            "между государством и людьми; между племенным правительством и гражданами этого племени;" +
            " между гражданами разных государств, между гражданами одного государства, претендующими на земли," +
            "" +
            " предоставленные разными государствами, а также между государством или его гражданами и иностранными государствами," +
            "" +
            " гражданами или подданными. А также между всеми членами Корпорации Международного Торгового Союза\n" +
            "\n" +
            "Во всех делах, касающихся послов, других государственных министров и консулов, а также в спорах, " +
            "затрагивающих два или более штатов, Верховный суд принимает первоначальную юрисдикцию. Во всех других случаях," +
            " упомянутых выше, Верховный суд обладает апелляционной юрисдикцией, как в отношении закона, так и в отношении фактов," +
            " с такими исключениями и в соответствии с такими правилами, которые будут приняты Конгрессом.\n" +
            "\n" +
            "Суд над всеми преступлениями осуществляется судом присяжных;" +
            " и такое судебное разбирательство должно проводиться в штате, где были совершены указанные преступления;" +
            " но когда дело не совершено в каком-либо штате, судебное разбирательство должно проводиться в таком месте или местах," +
            " которые Корпорация Международного Торгового Союза может установить по закону.\n" +
            "\n" +
            "Ни один суд не должен быть тайным, но правосудие должно вершиться открыто и бесплатно, полностью и безотлагательно," +
            " и каждый человек должен иметь правовую правовую защиту от вреда, причиненного жизни, свободе или имуществу." +
            "Верховный Суд CORPORATE_SUPREME_COURT";





}
