package International_Trade_Union.CorporateCharterDraft;

/**устарел(недействителен), является черновиком, но его хеш используется в генезис блоке.
 Но с помощью новых законов можно добавить те части которые будут интересны и сделать их действительным законом, если
 данные части не противоречат действующему уставу и действующим законам.
 */public interface ArticleTwoSpecialPositionDraft {
 String SECTION_1 = " любое лицо может занимать специальные высшие должности" +
         ". Все Специальные должности и членство в Совете Акционеров" +
         " могут занимать как физические, так и юридические лица.";


    String CHAPTER_2 = " Совет директоров BOARD_OF_DIRECTORS Корпорации Международного" +
            " Торгового Союза осуществляет общее руководство деятельностью, детали данной дейтельности должны быть" +
            " описаны принятыми и действующими законами. Обязаности и полномочия совета директоров, как и других HigherSpecialPositions" +
            " и других руководящих органов должны быть описаны действующими законами," +

            " Избраный совет директоров как описано в даном уставе, должен рукодоводить данной системой," +
            "для общего блага всех участников данной системы и ее граждан. Совет директоров это колективный" +
            "орган исполнительной власти в данной системе." +

            "Любое решение совет директоров должен принимать большинством голосов среди действующих членов совета директоров совета директоров." +
            "Ни одно решение совета директоров не должно нарушать устав или действующие законы Корпорации Международного Торгового Союза," +
            "Ни один орган или специальные должности не имеет права нарушать устав или действующие законы.";

    String CHAPTER_3 = "" +
            "Все должности  HigherSpecialPositions внутри каждой группы равнозначны и должны колективные решения принимать " +
            "большинством голосов." +
            "DEPARTMENT_OF_CORPORATE_JOURNALISTS отдел корпоративных журналистов занимается независимым " +
            " информированием членов Корпорации Международного Торгового Союза о происходящих событиях.";

    String CHAPTER_4 = " Большинство специальных должностей HigherSpecialPositions которые описаны здесь , и их " +
            "полномочия и обязаности," +
            " и их иерахия должны определяться действующими законами (между разными должностями), с учетом целей и" +
            " приоритетов текущей реальности и" +
            " потребностей Корпорации Международного Торгового Союза. Каждая такая должность является руководством, но иерархия" +
            "данного руководства должна определяться действующими законами(имеется ввиду иерархия между должностями)." +
            "Но внутри одной группы должностей, все должности равны. (Пример члены совета директоров равны.)";




}
