package International_Trade_Union.CorporateCharterDraft;

/**устарел(недействителен), является черновиком, но его хеш используется в генезис блоке.
 Но с помощью новых законов можно добавить те части которые будут интересны и сделать их действительным законом, если
 данные части не противоречат действующему уставу и действующим законам.
 */
public interface ArticleFiveCharterSupremacyDraft {
    String CHAPTER_1 = "Все долги и обязательства, заключенные до принятия настоящего Устава, будут иметь такую" +
            "же силу в отношении тех членов которые присоединились к " +
            " Международному Торговому Союзу в соответствии с настоящим Уставом, как и прежде." +
            "Настоящий Устав и действующие законы Корпорации Международного Торгового Союза, которые должны быть приняты во исполнение ее;" +
            " и все договоры, заключенные или которые будут заключены под властью Корпорации Международного Торгового Союза," +
            " являются высшим законом Корпорации Международного Торгового Союза;" +
            " и судьи на територии принадлежащей членам Корпорации Международного Торгового Союза должны быть связаны этим, несмотря " +
            "ни на что в" +
            " правилах или законах любого члена об обратном.\n" +
            "\n" +
            " но никакие религиозные испытания никогда не должны требоваться в качестве квалификации для какой-либо должности " +
            "или Корпоративного фонда в Корпорацию Международного Торгового Союза.";

    String CONSTITUTIONAL_SUPERMACY = "Ратификация Данного Устава происходит сразу как избраны триста и более членов Совета Акционеров,";
}
