package International_Trade_Union.CorporateCharterDraft;

/**устарел(недействителен), является черновиком, но его хеш используется в генезис блоке.
 Но с помощью новых законов можно добавить те части которые будут интересны и сделать их действительным законом, если
 данные части не противоречат действующему уставу и действующим законам.
 */
public interface ArticleSixBillOfRightsDraft {
    String SECTION_1 = "Ни один орган данной корпорации или субъект не должен запрещать свободное исповедание " +
            "какой-либо религии; или ограничивать свободу слова, совести или печати;" +
            " или право людей мирно собираться или объединяться друг с другом, или не объединяться друг с другом, и " +
            "обращаться к руководству Корпорации Международного Торгового Союза и к данной корпорации с ходатайством об удовлетворении жалоб;" +
            " или нарушать право на плоды своего труда или " +
            "право на мирную жизнь по своему выбору. Свободы слова и совести включают свободу вносить вклад в " +
            "политические кампании или кандидатуры на корпоративные должности и должны толковаться как" +
            " распространяющиеся в равной степени на любые средства коммуникации.";

    String CHAPTER_2 = "Ни одно лицо в мирное время не может быть расквартирован в каком-либо доме без согласия владельца," +
            " а также во время форсмажорных обстоятельств, кроме как в порядке, установленном законом. " +
            "Это положение применяется в равной степени на всей територии Корпорации Международного Торгового Союза.";


    String CHAPTER_3 = "Право людей на защиту своих лиц, перемещений, личных данных, домов, документов," +
            " данных и вещей от необоснованных обысков и конфискаций не должно нарушаться, " +
            "и никакие ордера не должны выдаваться, кроме как при наличии достаточных оснований, " +
            "подкрепленных присягой. или утверждение, в частности описание места, лиц или вещей," +
            " подлежащих обыску или конфискации. Это положение применяется в равной степени на всей " +
            "територии Корпорации международного Торгового Союза.";

    String CHAPTER_4 = "Ни одно лицо не может быть привлечено к ответственности за какое-либо" +
            " уголовное преступление, кроме как по представлению или обвинению Большого жюри, " +
            "за исключением случаев" +
            " или общественной опасности; ни одно лицо не может подвергаться опасности для жизни или" +
            " здоровья дважды за одно и то же преступление; ни " +
            "в каком уголовном деле он не может быть принужден свидетельствовать против самого себя," +
            " а также не может быть лишен жизни, свободы или имущества без надлежащей правовой процедуры;" +
            " частная собственность не может быть изъята для общественного пользования без справедливой компенсации," +
            " выплаченной в течение разумного периода времени. Это положение применяется в равной степени как на всей" +
            "територии Корпорции Международного Торгового Союза." ;

    String CHAPTER_5 = "Во всех уголовных делах обвиняемый имеет право на быстрое и открытое судебное разбирательство" +
            " беспристрастным судом присяжных того штата и округа, где было совершено преступление," +
            " район которого должен быть предварительно установлен законом, " +
            "и быть информированным о характер и причина обвинения; встретиться со свидетелями против него;" +
            " иметь обязательный процесс для получения свидетелей в свою пользу и иметь помощь адвоката для своей защиты." +
            " данная корпроация должно нести бремя демонстрации ясными и убедительными доказательствами того, " +
            "что любой отказ от таких прав должен быть осознанным, разумным и добровольным.";

    String CHAPTER_6 = "В исках по общему праву право на рассмотрение дела присяжными должно быть " +
            "таким же, как и в штате, где заседают присяжные, " +
            "и ни один факт, рассматриваемый присяжными, " +
            "не может быть повторно рассмотрен в каком-либо суде Корпорации Международного Торгового Союза иначе," +
            " чем в соответствии с правилами общего права. " +
            "В состязательных разбирательствах, когда на карту поставлены основные человеческие потребности, " +
            "такие как те, которые касаются крова, средств к существованию, безопасности, депортации," +
            " здоровья или опеки над детьми, должен быть предоставлен компетентный адвокат," +
            " и разумные расходы на такого адвоката оплачиваются Корпорорацие Международного Торгового Союза правительством, " +
            "правительствами штатов и территорий. государственные расходы малоимущим.";

    String CHAPTER_7 = "Не могут применяться жестокие, необычные или чрезмерные наказания или штрафы, а также не может" +
            " требоваться чрезмерный залог. Наказание смертной казнью, пожизненным заключением или эквивалентным сроком" +
            " лишения свободы запрещается. Это положение применяется в равной степени на всей територии Корпорации Международного" +
            " Торгового Союза.";

    String CHAPTER_8 = "Ни рабство, ни подневольный труд не должны существовать в Корпорации Международного" +
            " Торгового Союза или в любом другом месте, находящемся под их юрисдикцией." +
            "Корпорация Международного Торгового Союза" +
            " имеет право обеспечить соблюдение этой статьи посредством соответствующего законодательства.\n" +
            "\n" +
            " ";

    String CHAPTER_9 = "Все лица, родившиеся или натурализованные на територии штатов входящих в Международный Торговый Союз а также их родители" +
            "и дети и братья и сестры являются гражданами и членами Корпорации Международного Торгового Союза" +
            " и штата, в котором они проживают.  Корпорация Международного Торгового Союза, " +
            "ни  не должны принимать или применять какой-либо закон, который " +
            "ущемляет естественные или гражданские права граждан корпорации Международного Торгового Союза; или лишить любого человека" +
            " свободы или собственности без надлежащей правовой процедуры; или отказывать любому лицу в пределах своей " +
            "юрисдикции в равной защите закона.\n" +
            "\n" +
            "Использование слов «он» и «его» в настоящей кодексе распространяется на всех лиц.";

    String CHAPTER_10 = "Надлежащая правовая процедура должна толковаться как предоставление возможности представить" +
            " доказательства или иным образом показать, что закон, постановление или приказ является нарушением таких прав любого " +
            "гражданина или законного резидента Корпорации  Международного Торгового Союза, и сторона, защищающая оспариваемый закон," +
            " постановления или распоряжения несут бремя установления их основы в законе и в соответствии с настоящим Уставом. " +
            "Ни одно лицо не может быть подвергнуто уголовному наказанию без судебного разбирательства," +
            " направленного на установление того, виновно ли это лицо в нарушении законно принятого статута," +
            " принятие которого находится в пределах надлежащих полномочий Международного Торгового Союза" +
            " или законодательного собрания штата." +
            " Все лица предположительно свободны пользоваться своей жизнью, " +
            "свободой или имуществом и распоряжаться ими по своему усмотрению, и всякий раз," +
            " когда Корпорация международный Торговый Союз нарушает это право," +
            " и любое лицо требует возмещения ущерба,";

    String CHAPTER_11 = "Право голоса граждан Корпорации Межудународного Торгового Союза в возрасте восемнадцати лет и старше не может быть" +
            " ограничено или ограничено Международным Торговым Союзом на всей територии ," +
            " за исключением случаев наказания за преступление, " +
            "сторона которого должна иметь был должным образом осужден. Междунродный Торговый Союз или любое " +
            " Любой гражданин, временно проживающий в нежилом районе, являющемся резиденцией правительства " +
            "Международного Торгового Союза, считается гражданином штата, откуда он прибыл.";


    String CHAPTER_12 = "Право людей покупать и продавать законные товары и услуги на взаимоприемлемых условиях" +
            " не должно нарушаться Межданародным Торговым Союзом или правительством любого штата или племени." +
            "Только частное лицо в праве устанавливать цены на свои товары и услуги выставленые на продажу" +
            ", ни Корпорация Международного Торгового Союза, ни правительство штатов не имеет права ни какими законами, указами," +
            "резолюциями или любыми другими способами регулировать цены на товары или услуги частных лиц." +
             " Только лицо которое нанимает работника может устанавливать заработную плату, если" +
            "нанимаемый согласился добровольно работать по контракту за данную заработную плату, то это законно. " +
            "Ни Корпорация Международного Торгового Союза ни Правительство штата никами законами, резолюциями, указами или другими способами" +
            "не имеет регулировать заработную плату если был добровольный контракт между работадателем" +
            "или рабодадателями и нанимаемым, или нанимаемыми";

    String CHAPTER_13 = "Корпорация Международный Торговый Союз имеет право устанавливать законные основания для возбуждения" +
            " иска в связи с нарушением настоящей статьи.";

    String CHAPTER_14 = "Все люди в равной степени свободны и независимы и обладают определенными" +
            " естественными, неотъемлемыми и неотъемлемыми правами, которые они сохраняют при формировании любого правительства," +
            " среди которых пользование, защита и сохранение своей жизни и свободы, приобретение, владение и " +
            "защита недвижимого и личного имущества. ," +
            " заключая обязывающие контракты по своему выбору и стремясь к своему счастью и безопасности." +
            " Перечисление в Данном Уставе корпорации определенных прав не должно толковаться как отрицание или умаление других прав, " +
            "сохраняемых за народом, или придание этим перечисленным " +
            "правам приоритета или более принудительного исполнения по сравнению с неперечисленными правами.";

    String CHAPTER_15 = "Полномочия, прямо не делегированные  Международным Торговым" +
            " Союзом Конституцией и не запрещенные ею штатам, сохраняются соответственно за штатами или за народом. " +
            "И мы это имеем в виду.";

    String CHAPTER_16 = "Любое лицо которое находиться на территории подконтрольной  Международному Торговому Союзу," +
            " имеет право легально работать и заниматься комерческой дейтейльностью, если" +
            " данные действия нарушают действующие законы, с момента нахождения на территории подконтрольной Международного Торгового Союза.";

    String CHAPTER_17 = "Запрет на применение всеми банками частичного банковского резервирования" +
            "Все банки обязаны использовать обязательного полного банковского резервирования";

    String CHAPTER_18 = "Любые законы Коропрации Международного Торгового Союза или законы штата не могут вводить квоты. Запрещено" +
            "применение механизма квотирования Корпорацией Международного Торгового Союза или правительством штата." +
            "также запрещено тарифные квоты.";


   String CHAPTER_19 = "любое снижение правил для бизнеса должно касаться всех участников для бизнеса, не выделяя отдельные " +
           "компании, корпорации и т.д. Ни Корпорация Международного Торгового Союза, ни правительство Штата не может давать любые исключительные " +
           "привелегии или создавать фаворитов.";


    String CHAPTER_20 = "Любое лицо которое легально прожило на территории подконтрольной Международного торгового Союза три и более лет," +
                    " признается гражданином, Корпорации Международного Торгового Союза. " +
            "Также жителем Международного Торгового Союза признается лица входящие в " +
                    "руководство данной корпорации." +
            " Любое лицо хотя бы один раз создавшее через механизм данной криптовалюты закон, и заплатившее" +
            "вознаграждение майнеру за созданный закон " +
            "(на данный момент цена 144 цифровых доллара) также является гражданином Корпорации Международного" +
            "Торгового Союза." +
                    ". Также любое лицо которое получило гражданство, " +
                    "также сразу имеют право получить  его близкие родственики," +
                    "в которые входят родители, дети, братья и сестры, а также дедушки и бабушки. Гражданам разрешается обладать" +
            " гражданством нескольких стран или обладать гражданством нескольких похожих на данную корпорацию.";

    String CHAPTER_21 = "Ни Международный Торговый Союз, ни правительство штата или иные государственные учреждения" +
            " не могут регулирвать процентные ставки частных банков. Каждый частный банк сам в праве где хранить свои денежные " +
            "средства и устанавливать процентные ставки" +
            "и золото и любые свои ресурсы. Корпорация Международный Торговый Союз не имеет права требовать от банков хранить их средства " +
            "в хранилищях принадлежащих данной корпорации, но они могут это сделать добровольно";

    String CHAPTER_22 = "Везде где говориться федеральное правительство, имеется виду Корпорация Международный Торговый Союз и его ветви власти";

    String CHAPTER_23 = "Все граждане, члены и акционеры Корпорации Международного Торгового Союза" +
            " должны иметь право свободно передвигаться между штатами," +
            "все граждане членов союза должны иметь право свободно перевозить любые сумы денег между штатами." +
            "Все граждане должны иметь право свободно устраиваться на работу и заниматься комерческой дейтейльностью внутри штатов членов союза и иметь" +
            "право свободно предоставлять свои товары и услуги.";

    String CHAPTER_24 = "Кто может быть членом корпорации должно быть определено действующими законами. Корпорация Международного " +
            "Торгового Союза может предоставлять специальные услуги своим членам, а также своим акционерам. Членами являются" +
            "также все члены Совета Акционеров и Занимающие Специальные должности. При условии что специальные услуги не нарушают" +
            "Устав и действующие законы";

}
