package International_Trade_Union.CorporateCharterDraft;
/**устарел(недействителен), является черновиком, но его хеш используется в генезис блоке.
 Но с помощью новых законов можно добавить те части которые будут интересны и сделать их действительным законом, если
 данные части не противоречат действующему уставу и действующим законам.
 */
public interface ArticleFourAmendmentProcessDraft {

    String CHAPTER_1 = "Любые поправки можно вводить только после пяти лет с момента основания данной криптовалюты (начало 20.Января.2023)." +
            "Всякий раз, две третьи Совета Ационеров проголосовало, но при условии что будет создан действующий закон за пол года" +
            " до введения поправок и там будет описано как будет происходить внесения поправок и какие поправки предлагается вносить," +
            " но если закон не был действительным на момент" +
            "начала даты голосования поправок, то поправки не имеют силы. " +
            " сочтут это необходимым, они могут предложить поправки к настоящему Уставу, которые в любом случае будут иметь силу" +
            " во всех смыслах и целях, как часть настоящему Уставу, когда Верховный судья Корпорации Международного Торгового Союза" +
            " удостоверяет, что она ратифицирована действующим Советом Акционеров." +
            " при условии, что ни один член действующего Совета Акционеров без его согласия не может быть лишен равного " +
            " избирательного права (один счет члена Совета Акционеров, один голос.) Также поправки не должны ограничивать права (Статья 7)граждан или" +
            "всех членов Корпорации Международного Торгового Союза. Голосование должно быть реализовано через данную платформу," +
            " время на голосование должно быть отведено шесть месяцев. (Сначала нужно реализовать механизм голосования внутри данной сети, я не смог реализовать," +
            "чтобы все акционеры имели право голоса. Так что реализуйте данную часть сами. )" +
            "" +
            "Разрешается вводить любые улучшения в код данной системы, если это утверждено действующим законом, без поправок в устав" +
            " при условии если эти изменения не нарушают" +
            "Устав данной корпорации и не изменяют сам устав, а также соблюдают устав и действующие законы. А также действующие " +
            "правила для разработки законов и создания должностных лиц, включая отрицательную ставку и другие " +
            "правила описанные в данном уставе.";
}
