package International_Trade_Union.CorporateCharterDraft;
/**устарел(недействителен), является черновиком, но его хеш используется в генезис блоке.
 Но с помощью новых законов можно добавить те части которые будут интересны и сделать их действительным законом, если
 данные части не противоречат действующему уставу и действующим законам.
 */
public interface PreambleDraft {
    String ARTICLE_0 = " Корпорпация Международнодного Торгового Союза, создана с целью развития международной торговли." +
            " Корпорация Международного Торгового Союза ставит своей целью предоставление экосистемы, а также своей продукции " +
            " и услуг, которые облегчают торговлю и при этом не нарушая естественных прав человека. " +
            "Корпорация Международного Торгового Союза это форма демократии, где голоса приравниваются количеству акций," +
            "такая форма позволяет учитывать вклад каждого в развитие данного сообщества, таким образом создавая условие" +
            "где все участники заинтиресованы в развитии данного сообщества. Как так каждый участник становиться заинтересованым" +
            "лицом, и каждый хочет что бы благосостояние данного общества процветало.";


}
