package International_Trade_Union.setings.originalCorporateCharter;

public interface OriginalPreamble {
    String ARTICLE_0 =
            " Корпорация Международный Торговый Союз это криптовалютная организация целью которой является создание " +
            " единой торговой эко-системы, позволяющая людям из разных уголков земли продавать, а также приобретать " +
            " высококачественные товары и услуги, по самым доступным ценам, при этом соблюдая права человека. " +
            "" +
            " Корпорация Международный Торговый Союз использует дивизионную продуктовую организационную структуру. " +
            " В случае если возникли противоречия в Английской версии и Русской, брать за основу русскую версию " +
            " Устава, так как перевод был осуществлен из Русской в Английскую версию. ";
}
