package International_Trade_Union.setings.originalCorporateCharter;

public interface OriginalCHARTER {
        String LAW_1 = "\n" +
                "Устав Corporation International Trade Union (CITU)\n" +
                "Раздел I: Основные Положения\n" +
                "Статья 1: Общие Положения\n" +
                "1.1. Corporation International Trade Union (CITU) - это организация, направленная на создание международной валюты для объединения мирового рынка, достижения глобальных целей и в конечном итоге создания Соединенных Штатов Человечества.\n" +
                "1.2. Миссия CITU - создание единой международной валюты для всего человечества и объединения различных союзов и организаций, таких как Евросоюз, США, БРИКС, G7, ОДКБ, ООН и других, для решения общих человеческих проблем, таких как бедность, эпидемии, космические угрозы и т.д.\n" +
                "1.3. Официальной валютой CITU является криптовалюта, обеспеченная специальным алгоритмом.\n" +
                "Раздел II: Структура Управления до Образования Союза\n" +
                "Статья 2: Основатель\n" +
                "2.1. Основатель CITU имеет право изменять код и вносить поправки в устав до образования Союза.\n" +
                "2.2. Основатель имеет право наложить вето на любые решения до образования Союза, если они противоречат уставу или несут угрозу безопасности.\n" +
                "Статья 3: Совет Директоров\n" +
                "3.1. Совет Директоров состоит из 7 членов. Каждый участник сети может проголосовать за любого кандидата в Совет Директоров, где каждый кандидат получает столько голосов \"за\" или \"против\", сколько монет у избирателя в стэйкинге. 7 кандидатов с наибольшим рейтингом занимают места в Совете Директоров сроком на 2 года.3.2. Решения Совета Директоров принимаются большинством голосов (не менее 57%) и вступают в силу только после одобрения Судьями.\n" +
                "3.3. Совет Директоров может предложить поправки в устав при условии получения не менее 75% голосов и отсутствия вето со стороны Судей.\n" +
                "Статья 4: Судьи\n" +
                "4.1. Совет Судей состоит из 7 членов. Каждый участник сети может проголосовать за любого кандидата в Совет Судей, где каждый кандидат получает столько голосов \"за\" или \"против\", сколько монет у избирателя в стэйкинге. 7 кандидатов с наибольшим рейтингом занимают места в Совете Судей сроком на 2 года.\n" +
                "4.2. Судьи имеют право наложить вето на любые решения до образования Союза, если количество голосов против превышает количество голосов за.\n" +
                "4.3. Судьи решают споры между участниками CITU и органами управления.\n" +
                "Статья 5: Генеральный Директор\n" +
                "5.1. Генеральный Директор избирается участниками CITU на срок 2 года.\n" +
                "5.2. Генеральный Директор отвечает за внешние взаимоотношения и исполнение решений до образования Союза.\n" +
                "Раздел III: Избирательная Система\n" +
                "Статья 6: Право Голоса\n" +
                "6.1. Каждый участник, имеющий монеты и зарезервировавший их в стейкинг, имеет право голоса пропорционально стейкинг-балансу.\n" +
                "6.2. Голоса привязаны к счетам участников.\n" +
                "Статья 7: Избирательная Процедура\n" +
                "7.1. До образования Союза для избрания должностных лиц используется стандартная процедура голосования, основанная на стейкинг-балансе.\n" +
                "7.2. После образования Союза Соединенных Штатов Человечества:\n" +
                "а) Палата представителей избирается следующим образом: Избиратели оценивают кандидатов от 0 до 5 звезд. Два кандидата, набравшие наибольшее количество баллов, становятся финалистами. Затем проводится второй тур по принципу \"один человек - один голос\", где весь голос избирателя отдается тому финалисту, которого он предпочитает. Победителями становятся кандидаты, набравшие наибольшее число голосов.\n" +
                "б) Сенат избирается аналогичным образом системой \"star voting\".\n" +
                "в) Коллегия выборщиков, избирающая Президента, формируется с использованием системы \"star voting\" для избрания ее членов.\n" +
                "г) Избиратели голосуют за кандидатов в президенты с помощью \"star voting\".Раздел IV: Переходный Период после Образования Союза\n" +
                "Статья 8: Основные Положения\n" +
                "8.1. После образования Союза Соединенных Штатов Человечества с участием двух или более штатов/государств, полномочия CITU передаются новым органам власти согласно Конституции США с учетом следующих поправок:\n" +
                "Поправка 1: Основатель CITU сохраняет церемониальный статус \"Отец-Основатель Союза\" с правом консультировать и участвовать в церемониальных мероприятиях.\n" +
                "Поправка 2: Национальной валютой Союза становится монета доллар криптовалюты CITU, либо любая иная валюта, 100% обеспеченная данной монетой по фиксированному курсу. Новый курс может быть утвержден Конгрессом каждые 8 лет при условии подписания действующим Президентом, который не сможет баллотироваться на следующий срок после утверждения курса.\n" +
                "Поправка 3: Для избрания Палаты представителей, Сената и формирования коллегии выборщиков, избирающей Президента, используется система \"star voting\".\n" +
                "Поправка 4: Избиратели голосуют за кандидатов в президенты с помощью \"star voting\".\n" +
                "Статья 9: Передача Полномочий\n" +
                "9.1. С момента образования Союза весь контроль переходит к Конгрессу и Президенту Соединенных Штатов Человечества в соответствии с Конституцией США с учетом поправок из Статьи 8.\n" +
                "9.2. Устав CITU приобретает второстепенную силу после принятия Конституции Союза.\n" +
                "Раздел V: Майнинг\n" +
                "Статья 10: Принципы Майнинга\n" +
                "10.1. Майнинг основан на алгоритме, объединяющем элементы Proof of Stake (PoS) и Proof of Work (PoW).\n" +
                "10.2. Для майнинга необходимо перейти на страницу localhost:8082/, где автоматически включается многопоточность. Затем в меню в правом верхнем углу нажать на \"Get Locked\", выбрать \"Start\", и нажать на \"International Union Corporation\". В информационном окне должно появиться сообщение \"Is Mining Proper\".\n" +
                "10.3. В консоли не отображается информация о процессе майнинга, чтобы не замедлять его.\n" +
                "10.4. Для остановки майнинга нужно дважды нажать на кнопку \"Stop\" и затем на надпись \"Corporation International Union\". Если все остановилось корректно, информационное окно исчезнет.\n" +
                "10.5. Блок считается валидным, если его хеш соответствует целевому значению по формуле:\n" +
                "javaCopyint result = deterministicRandom.nextInt(limit);\n" +
                "result = (int) ((int) (result + (actual.getHashCompexity() * waight)) + calculateScore(miner.getDigitalStakingBalance(), number));\n" +
                "10.6. Система майнинга стимулирует плавное увеличение стоимости монеты, предотвращая резкие падения и устойчива к сильной волатильности.\n" +
                "10.7. Вкладчики могут делать ставки или снимать средства на вкладку http://localhost:8082/mining.\n" +
                "10.8. Баланс аккаунтов проверяется на http://localhost:8082/testCalculate. Если обнаружены несоответствия, необходимо сообщить владельцу сервера.\n" +
                "10.9. В системе выигрывает блок с наибольшим значением случайного числа, которое определяется по трем компонентам: сложность, случайное число, стейкинг.\n" +
                "10.10. Каждый узел выбирает блок с наибольшим количеством очков каждые 100 секунд и сравнивает его с блоками других узлов.\n" +
                "10.11. Вознаграждение за майнинг рассчитывается по формуле:\n" +
                "javaCopy(5 + coefficient + (difficulty * 0.2)) * multiplier\n" +
                "10.12. Исторические особенности системы включают создание специального блока на индексе 24281 для компенсации участников, пострадавших от атаки на блокчейн.\n" +
                "Статья 11: Резервные Положения Майнинга\n" +
                "11.1. Если обнаружены нарушения при майнинге, Совет Судей имеет право наложить временный мораторий на выпуск новых монет.\n" +
                "11.2. В случае форс-мажорных обстоятельств, угрожающих системе, Основатель может ввести чрезвычайное положение и временно приостановить майнинг.\n" +
                "11.3. После устранения нарушений или форс-мажора майнинг возобновляется в штатном режиме.\n" +
                "Раздел VI: Заключительные Положения\n" +
                "Статья 12: Вступление в Силу\n" +
                "12.1. Настоящий Устав вступает в силу с момента его утверждения Основателем.\n" +
                "Статья 13: Изменения Устава\n" +
                "13.1. До образования Союза любые изменения в Устав могут быть внесены с одобрения Основателя.\n" +
                "13.2. После образования Союза действуют положения Конституции Соединенных Штатов Человечества.\n" +
                "Раздел VII: Временные Положения\n" +
                "Статья 14: Временные Голосования\n" +
                "14.1. Любой голос учитывается в системе в течение 2 лет, где за год берется 360 дней, а за сутки примерно 576 блоков.\n" +
                "14.2. Голоса могут быть отменены или изменены неограниченное количество раз.\n" +
                "14.3. Голоса привязаны к счетам, и их количество изменяется в зависимости от стейкинг-баланса. Это касается также должностных лиц.\n" +
                "14.4. Голоса можно переголосовать, и отсчет будет снова начинаться с 2 лет.\n" +
                "Статья 15: Снятие Должностных Лиц\n" +
                "15.1. Любую должность можно снять, если рейтинг должностного лица упадет ниже 1 или относительно других кандидатов.\n" +
                "15.2. Генеральный Директор может быть снят с должности при падении рейтинга или по решению Совета Директоров и Судей.\n" +
                "Статья 16: Финансовый Аудит\n" +
                "16.1. За финансовый аудит отвечает Совет Судей.\n" +
                "16.2. Траты, полученные добровольно, контролируются Советом Директоров и Генеральным Директором.\n" +
                "16.3. Создается финансовый комитет с представителями Совета Директоров и Судей для координации финансового аудита и контроля за тратами.\n" +
                "Статья 17: Права Участников\n" +
                "17.1. Каждый участник имеет право избираться и быть избранным.\n" +
                "17.2. Каждый участник имеет право создавать решения, за которые могут голосовать другие участники.\n" +
                "17.3. Участники, имеющие монеты и зарезервировавшие их в стейкинг, имеют право голосовать.\n" +
                "Заключение\n" +
                "Данный Устав устанавливает основы для управления CITU до момента образования Союза Соединенных Штатов Человечества. После создания Союза все полномочия передаются новым органам власти в соответствии с Конституцией США с учетом специальных поправок, обеспечивающих плавный переход. Основная цель CITU - содействие объединению человечества посредством единой валюты для решения глобальных проблем.\n" +
                "дата утверждения устава 17.06.2024 основатель nNifuwmFZr7fnV1zvmpiyQDV5z7ETWvqR6GSeqeHTY43";
}
